/* *****************************************************
*	文件名: 				user_filesystem.c
*	作用: 					文件系统用户定义文件
*	创建文件时间:		2019/10/18
*	作者:						王小平
* ***************************************************** */

/**
  ******************************************************************************
  *                              头文件
  ******************************************************************************
  */
	
#include "user_filesystem.h"

/*
*************************************************************************
*                               变量
*************************************************************************
*/
FATFS fs;													/* FatFs文件系统对象 */


/*
*************************************************************************
*                               函数定义
*************************************************************************
*/

/**
	* 函数名:		uint8_t ucFileSystemInit(void)
	* 作用:			文件系统初始化
	* 参数:			无
	*	输出:			1->失败 0->成功
	*/
uint8_t ucFileSystemInit(void)
{
	FRESULT res_flash;                /* 文件操作结果 */
	
	//在外部SPI Flash挂载文件系统，文件系统挂载时会对SPI设备初始化
	res_flash = f_mount(&fs,"1:",1);
	
/*----------------------- 格式化测试 ---------------------------*/  
	/* 如果没有文件系统就格式化创建创建文件系统 */
	if(res_flash == FR_NO_FILESYSTEM)
	{
		printf(">>> FLASH还没有文件系统，即将进行格式化...\r\n");
    /* 格式化 */
		res_flash=f_mkfs("1:",0,0);							
		
		if(res_flash == FR_OK)
		{
			printf(">>> FLASH已成功格式化文件系统。\r\n");
      /* 格式化后，先取消挂载 */
			res_flash = f_mount(NULL,"1:",1);			
      /* 重新挂载	*/			
			res_flash = f_mount(&fs,"1:",1);
		}
		else
		{
			printf(">>> 《《格式化失败。》》\r\n");
			return 1;
		}
	}
  else if(res_flash!=FR_OK)
  {
    printf(">>> ！！外部Flash挂载文件系统失败。(%d)\r\n",res_flash);
    printf(">>> ！！可能原因：SPI Flash初始化不成功。\r\n");
		return 1;
  }
	
	printf(">>> SPI串行FLASH文件系统挂载成功\r\n");
	
	return 0;
}


